Revit 2024 API
ParameterTypeId.BoundaryDirectionX Property
 "X Translation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BoundaryDirectionX { get; }
Visual Basic
Public Shared ReadOnly Property BoundaryDirectionX As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BoundaryDirectionX {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace